[
    {
        "title": "Wisher Pro's terms and conditions",
        "text": "These terms and conditions (“Terms and Conditions”) are made between Wisher Pro TOO, Satpayeva st., b. 85, 050046, Almaty, Kazakhstan (“we”, “us”, “our”), and users who (i) use our website https://wisher.pro/ in its entirety, including all of our subpages, associated sites or pages (“Website”) and/or the Wisher Pro mobile app, which is accessible through mobile phone, tablet computer and personal computer (“App”) (collectively, “Wisher Pro”), (ii) download software for Wisher Pro (“Wisher Pro Software”), and/or (iii) use, access, or purchase in App products and services provided by Wisher Pro (“you”, “User”)."
    },
    {
        "title": "1. Acceptance of Terms and Conditions",
        "text": "Please read the following Terms and Conditions carefully before using Wisher Pro.<br><br>By downloading the Wisher Pro Software or using, accessing, or purchasing products and services of Wisher Pro, you are acknowledging that you have read, understood, and agreed to be bound by the (i) Terms and Conditions, (ii) privacy policy (see here), (iii) cookie policy (see here), and (iv) any terms disclosed and agreed to by you if you purchase additional features, products, or services we offer on Wisher Pro (collectively, “Agreement”).<br><br>You acknowledge and agree that the availability of Wisher Pro and the Wisher Pro Software is dependent on the third party from which you received the Wisher Pro Software (e.g., Google Play, Apple App Store, or HUAWEI AppGallery (each, “App Store”)). You acknowledge that the Agreement is between you and us and not with the App Store. Each App Store may have its own terms and conditions to which you must agree before using or accessing Wisher Pro or downloading the Wisher Pro Software.<br><br>If you do not accept and agree to be bound by all the terms of the Agreement and the applicable terms and conditions of the respective App Store, please do not access or use Wisher Pro."
    }
]
