[
    {
        "title": "Wisher Pro's terms and conditions",
        "text": "These terms and conditions (“Terms and Conditions”) are made between Wisher Pro TOO, Satpayeva st., b. 85, 050046, Almaty, Kazakhstan (“we”, “us”, “our”), and users who (i) use our website https://wisher.pro/ in its entirety, including all of our subpages, associated sites or pages (“Website”) and/or the Wisher Pro mobile app, which is accessible through mobile phone, tablet computer and personal computer (“App”) (collectively, “Wisher Pro”), (ii) download software for Wisher Pro (“Wisher Pro Software”), and/or (iii) use, access, or purchase in App products and services provided by Wisher Pro (“you”, “User”)."
    },
    {
        "title": "1. Acceptance of Terms and Conditions",
        "text": "Please read the following Terms and Conditions carefully before using Wisher Pro.<br><br>By downloading the Wisher Pro Software or using, accessing, or purchasing products and services of Wisher Pro, you are acknowledging that you have read, understood, and agreed to be bound by the (i) Terms and Conditions, (ii) privacy policy (see here), (iii) cookie policy (see here), and (iv) any terms disclosed and agreed to by you if you purchase additional features, products, or services we offer on Wisher Pro (collectively, “Agreement”).<br><br>You acknowledge and agree that the availability of Wisher Pro and the Wisher Pro Software is dependent on the third party from which you received the Wisher Pro Software (e.g., Google Play, Apple App Store, or HUAWEI AppGallery (each, “App Store”)). You acknowledge that the Agreement is between you and us and not with the App Store. Each App Store may have its own terms and conditions to which you must agree before using or accessing Wisher Pro or downloading the Wisher Pro Software.<br><br>If you do not accept and agree to be bound by all the terms of the Agreement and the applicable terms and conditions of the respective App Store, please do not access or use Wisher Pro."
    },
    {
        "title": "2. Modification of the Agreement",
        "text": "We reserve the right to modify, add to, change, or remove parts of the Agreement at any time at our own discretion (“Modifications”).<br><br>If the Modifications include material changes to your rights or obligations, you will be notified at least 10 days in advance of the changes via (i) an email sent to the last email address you provided and (ii) a notice of such alterations posted on Wisher Pro. If, for any reason, an email sent by us to this email address does not reach you, the email sent will nonetheless be considered an effective notice of the changes being undertaken by Wisher Pro.<br><br>If the Modifications are not material, we will notify you by posting a notice of such alterations on Wisher Pro.<br><br>It is your responsibility to provide us with an up-to-date email address and to check from time to time for changes to the Agreement. Please be assured that we will provide clear notifications for any adjustments made to the Agreement. By continuing to use Wisher Pro following the dispatch of an email to you containing notice of changes to the Agreement, or after notice of such alterations was posted on Wisher Pro, your binding acceptance of these alterations is constituted, and agreement that such alterations shall automatically come into effect 10 days after our email giving notice to you was sent, or 10 days after notice of the changes was posted on Wisher Pro, is given."
    },
    {
        "title": "3. Eligibility",
        "text": "To use Wisher Pro, you must have a mobile device that is compatible with the Wisher Pro application. We do not warrant that Wisher Pro will be compatible with your mobile device.<br><br>Section 230(d) Notice. In accordance with 47 U.S.C. § 230(d), you are notified that parental control protections (including computer hardware, software, or filtering services) are commercially available that may help in limiting access to material that is harmful to minors. You may find information about providers of these protections on the Internet by searching “parental control protection” or similar terms. "
    },
    {
        "title": "4. Rights we grant you",
        "text": "We, our subsidiaries, and affiliated companies, own all rights, titles, and interests in any inventions, ideas, discoveries, trade names, logos, domain names, concepts, processes, design methods, trade secrets, know-how, databases, computer programs, work products, and other intellectual property, including related intellectual property rights (including but not limited to patents, copyrights, trademarks, designs, any registration thereof and pending applications therefor), irrespective of their form and whether registerable or legally protectable relating to Wisher Pro and the Wisher Pro Software (collectively, “Materials”).<br><br>Subject to the terms of the Agreement, we hereby grant you a worldwide, non-exclusive, royalty-bearing, revocable, non-transferable, non-sublicensable license to access and use the Materials for your personal, non-commercial use only (“License”). Subject to our express prior written consent, you may not access and use the Materials in any way other than as set out in the Agreement. In particular, and to the extent permitted by applicable law, you may not:<br><br>• modify, disassemble, decompile, or reverse engineer the Materials;
        <br>• rent, lease, loan, resell, sublicense, distribute, or otherwise transfer the Materials to any third party;
        <br>• publicly perform or display, transmit, or publish the Materials;
        make copies, edit, adapt, create derivative works from, or otherwise make unauthorized use of the Materials;
        <br>• remove, circumvent, disable, damage, or otherwise interfere with security-related features of Wisher Pro;
        <br>• delete the copyright and other proprietary rights notices on Wisher Pro.<br><br>With respect to any open source or third-party code that may be incorporated in the Materials, such open-source code is covered by the applicable open source or third-party end user license, if any, authorizing use of such code. Nothing in the Agreement limits your rights under, or grants you rights that supersede, the terms and conditions of any applicable end user license for such open-source software.<br>Wisher Pro's name, Wisher Pro's logo, and all related names, logos, product and service names, designs, and slogans are trademarks of Wisher Pro or its affiliates or licensors. You must not use such marks without the prior written permission of Wisher Pro. All other names, logos, product and service names, designs, and slogans on the Website or contained in the Materials are the trademarks of their respective owners."
    },
    {
        "title": "5. Your account credentials, your interactions with other Users",
        "text": "If you choose to use, purchase in App products and services provided by Wisher Pro, or register for an account with Wisher Pro, you confirm and warrant that (i) all the registration information you submit is truthful and accurate and (ii) you will keep this information accurate and up to date.<br><br>If you identify inaccuracies or incompleteness, we will act accordingly, rectify such errors and communicate the necessary updates to the relevant data recipients. Detailed information on this process can be found within our comprehensive Privacy Policy.<br><br>You are responsible for maintaining the confidentiality of your login credentials and for the security of your mobile or other electronic device and are fully responsible for all activities that occur under those credentials. You agree to notify us immediately of any unauthorized or suspected unauthorized use of your Wisher Pro account, or any other breach of security. You shall keep your login credentials (e.g. usernames and passwords) confidential and not disclose any such credentials to, or share any such credentials with, any third party.<br><br>You are solely responsible for your interactions between your profile and the profiles of other Users. You acknowledge that we do not conduct criminal background checks on our Users or otherwise inquire into the background of our Users.<br><br>To the extent permitted by applicable law, you agree that Wisher Pro is not liable for any loss or damage resulting from (i) your failure to comply with the above requirements and/or (ii) your interactions with other User profiles. Please note that we reserve the right (but have no obligation):<br><br>• to monitor any User’s use of Wisher Pro, including registration attempts, and a User’s use of or access to the location information or profiles of other Users;
        <br>• to monitor disagreements between you and other Users that result in reporting violations of Wisher Pro’s Terms and Conditions;
        <br>• to monitor the User submissions (defined in Art. 7 of the Terms and Conditions) and communication for any purpose. However, we do not control the User Submissions or communication and you acknowledge that you are solely responsible for all the content or material posted in your User Submissions or included within your conversations, whether sent or received by you;
        <br>• to disable any User’s access to Wisher Pro, or to close any User’s account, for any reason and without any notice;
        <br>• to refuse access to any User for any reason, without notice."
    },
    {
        "title": "6. Guidelines and prohibited conduct",
        "text": "The License and any authorization to access and use Wisher Pro and/or download the Wisher Pro Software will be automatically revoked if you fail to comply with the Guidelines. This applies, but is not limited to, if you:<br><br>• use Wisher Pro for any commercial or non-private use without our prior written consent;<br>• use Wisher Pro in violation of other eligibility requirements set forth in Art. 3 of the Agreement;<br>• use Wisher Pro or any location information obtained from Wisher Pro to stalk, harass, intimidate, abuse, defame, threaten, or defraud other Users;<br>• use Wisher Pro or exploit it for financial gains, to engage in or encourage fraudulent financial or other activities, perpetrate financial scams, or attempt to bypass the Agreement’s rules and applied policies for any kind of financial gains or advantages,<br>• make use of obscene, offensive, or pornographic materials, or materials that depict minors or are in any way harmful to minors in your Wisher Pro account;<br>• share and publish User Submissions (defined in Art. 7 of the Agreement) that promotes racism, bigotry, hatred or physical harm of any kind against any group or individual;<br>• send junk messages to other Users, or make unsolicited offers, advertisements, or proposals to them. This includes but is not limited to unsolicited advertising, promotional materials, or other solicitation material, bulk mailing of commercial advertising, chain mail, informational announcements, charity requests, or requests to sign petitions;<br>• use Wisher Pro for any illegal purpose, or in violation of any law, whether local, state, national, international, or otherwise, including but not limited to laws governing intellectual property and other proprietary rights, data protection and privacy, and import or export control;<br>• create another account, even if yours was already terminated by us in the past, unless you have our exclusive permission;<br>• access or attempt to access the Wisher Pro account of any other User;<br>• impersonate any person or entity, or falsely claim a connection with any person or entity;<br>• make any misrepresentation about the source, identity, or content of information transmitted via Wisher Pro;<br>• remove, disable, override, circumvent, interfere with, or in any way defeat the purpose of security-related features of Wisher Pro, or make any attempt to do so. This includes security features that prevent or restrict the use of, or copy content accessed through Wisher Pro, or features that enforce limitations on the use of Wisher Pro;<br>• deliberately interfere with or damage the operation of Wisher Pro, or any User’s full access to and enjoyment of Wisher Pro, by any means, including but not limited to introducing or knowingly allowing the introduction of any virus, worm, Trojan, or other malicious code;<br>• gain or attempt to gain unauthorized access to Wisher Pro, or any part of it, or to other accounts, computer systems, or networks connected to Wisher Pro, or any part of it, through hacking, password mining or by any other means, or interfere or attempt to interfere with the proper working of Wisher Pro or any activities conducted on Wisher Pro;<br>• use or attempt to use any robot, spider, scraper, or other automated means to access Wisher Pro for any purpose without our express written prior consent, or bypass our robot exclusion headers or other measures we may use to prevent or restrict access to Wisher Pro, or modify Wisher Pro in any manner or form, or use modified versions of Wisher Pro for the purpose of obtaining unauthorized access to Wisher Pro, or any other purpose;<br>• post, store, transmit or in any way disseminate, or allow, whether knowingly or not, the transmission or dissemination of any material which is intentionally misleading, false, or otherwise inappropriate, regardless of whether this material or its dissemination is unlawful;<br>• post, store, transmit or in any way disseminate or allow, whether knowingly or not, the transmission or dissemination of any material which infringes any patent, design, trademark, copyright, or any other proprietary or intellectual property right;<br>• use Wisher Pro or attempt to use Wisher Pro for tracking, locating, navigating, or controlling any person, vehicle or other equipment or machinery, other than locating another User in the course of the bona fide use of the App in accordance with its intended purpose as set out in the Agreement;<br>• use Wisher Pro or attempt to use Wisher Pro with any products, systems, or applications installed or otherwise connected to or in communication with vehicles of any sort; or<br>• use Wisher Pro in connection with hazardous environments requiring fail-safe performance or any application in which the failure or inaccuracy of that application or of Wisher Pro could lead directly to death, personal injury, or severe physical or property damage."
    },
    {
        "title": "7. Content submitted by Users",
        "text": "Wisher Pro hosts content and material which has been submitted by Users as “Personal ad and Profile” and content and material which has been submitted in the chat conversations (collectively, “User Submissions”) and allows it to be shared and published. As users participate by submitting content and material to Wisher Pro without any compulsion, posting the content and material on Wisher Pro is a completely voluntary act on their part. These User Submissions and certain other information about you are subject to and may be used by us in accordance with our Privacy Policy (see here). You are always solely responsible for your own User Submissions and for the consequences of posting or publishing them.<br><br>Regarding your User Submissions you affirm, represent, and warrant that:<br><br>• you own, or have the necessary licenses, rights, consents, and permissions to use, and authorize Wisher Pro to use, all intellectual property and any other proprietary rights in and to any and all User Submissions to enable inclusion and use of the User Submissions in the manner contemplated by Wisher Pro and the Agreement;<br>• you have the written consent, release, and/or permission of each and every identifiable natural or legal person in the User Submission to use the personal data (including but not limited to the name or likeness) of each and every such identifiable person to enable inclusion and use of the User Submissions in the manner contemplated by Wisher Pro and the Agreement;<br>• you understand that when using Wisher Pro you will be exposed to User Submissions from a variety of sources, and that we are not responsible for the accuracy, usefulness, safety, or intellectual property rights of or relating to such User Submissions. You further understand and acknowledge that you may be exposed to User Submissions that are inaccurate, offensive, indecent, or objectionable.<br><br>To the extent permitted by applicable law, we assume no responsibility in connection with or arising from any User Submissions. In this context, please note the following:<br><br>• We assume no responsibility for actively monitoring User Submissions for inappropriate content. If at any time we decide, solely at our discretion, to monitor User Submissions, we nonetheless do not assume any responsibility for the content of User Submissions, nor any obligation to modify or remove any inappropriate User Submissions, and no responsibility for the conduct of the User submitting User Submissions.<br>• We do not endorse and nor have any control over the content of User Submissions submitted by other Users. We make no warranties, express or implied, as to the content of User Submissions or the accuracy and reliability of any User Submissions. Nonetheless, we reserve the right to prevent you from submitting User Submissions and to edit, restrict, or remove User Submissions for any reason at any time.<br>• You own all rights, titles, and interests in all intellectual property and any other proprietary rights in and to all of your User Submissions. User Submissions cannot be shared, displayed, or duplicated by any other party other than the User with whom the User Submissions originate, except as permitted under this Agreement.<br>• You hereby grant, and represent and warrant that you have the right to grant, us an irrevocable, non-exclusive, transferrable, royalty-free and fully paid, worldwide license to reproduce, distribute, publicly display and perform, prepare derivative works of, incorporate into other works, and otherwise use your User Submissions, and to grant sublicenses of the foregoing, solely for the purposes of including your User Submissions in Wisher Pro and other services operated by us. You agree to irrevocably waive (and cause to be waived) any claims and assertions of moral rights or attribution with respect to your User Submissions.<br>• You agree to processing and transferring your anonymous textual User Submissions solely for the purpose of content moderation. This data will not be used for any commercial or marketing purposes. Furthermore, your textual User Submissions shall under this Article only be used for the purpose of scam and fraudulent activities detection and prevention, analysis, and not for any other commercial or marketing purposes.<br><br>These submissions will be anonymized and stripped of personal information to protect your privacy, with all parties ensuring data protection against unauthorized access or disclosure. For more information on how we ensure sufficient measures in data sharing, please refer to our Privacy Policy.<br><br>• To ensure that User Submissions fully comply with applicable laws and regulations, principles, guidelines and this Agreement, we use a combination of automated systems to monitor and review pictures from chat conversations in order to develop and improve Wisher Pro. You hereby grant us access and all rights to simultaneously train and use well-established computer algorithms and machine learning techniques for the purposes of enhancing user overall safety and blurring pictures that could contain explicit content in order to prevent non-consensual viewing of unwanted explicit content in chat conversations. You have the capability to view the blurred picture in chat conversations upon clicking on it, thereby ensuring an experience that is secure, controlled and consensual.<br><br>For this purpose User Submissions will be completely anonymized and stripped of personal information to protect your privacy, thereby ensuring data protection against unauthorized access or disclosure. Rest assured that the pictures used for training our well-established computer algorithms and machine learning techniques will be handled with the utmost security and protection. For more information about the measures we take to ensure your privacy when using Wisher Pro, please refer to our Privacy Policy.<br><br>If you provide any feedback, suggestions, or review to us about Wisher Pro (“Feedback”), you hereby assign to us all rights in such Feedback and agree that we shall have the right to use such Feedback and related information in any manner we deem appropriate. We will treat any Feedback you provide to us as non-confidential and non-proprietary.<br><br>We and our licensees may publicly display advertisements and other information adjacent to your User Submissions and Feedback. You are not entitled to any compensation for such advertisements."
    },
    {
        "8. Third-party sites, products, and services",
        "text": "We may include links to other web sites or services (“Third Party Websites”). We do not endorse any such linked sites or the information, material, products, or services contained on such linked sites or accessible through other linked sites. Furthermore, we make no express or implied warranties regarding the information, material, products, or services that are contained on or accessible through linked sites. Access and use of linked sites, including information, material, products, and services on linked sites or available through linked sites is solely at your own risk.<br><br>Your correspondence or business dealings with, or participation in promotions of, advertisers found on or through Wisher Pro are solely between you and such advertiser. You agree that we shall not be responsible or liable for any loss or damage of any sort incurred as the result of any such dealings or as the result of the presence of such advertisers on Wisher Pro.<br><br>Parties other than us may provide services or sell products through Wisher Pro. We are not responsible for examining or evaluating, and we do not warrant the offerings of any of these businesses, nor the content of their product and service offerings. We do not assume any responsibility or liability for the actions, product, or content of these or any other third parties. You should carefully review their privacy statements and other terms and conditions of use.<br><br>By using third party applications that connect with Wisher Pro (“Third Party Applications”), you acknowledge and agree that we may transmit User Submissions to Third Party Websites or Third Party Applications through application protocol interfaces developed and maintained by those Third Party Websites or Third Party Applications. Please note that User Submissions are a completely voluntary act, as users participate by submitting content and material to Wisher Pro without any compulsion. We are not responsible for the transmission of the User Submissions from Wisher Pro to Third Party Websites or Third Party Applications, nor the use of the User Submissions on any Third Party Websites or Third Party Applications. You should review the terms and conditions and privacy policies of any Third Party Websites or Third Party Applications. We are not responsible for and do not endorse any features, content, or other materials on or available from Third Party Websites or Third Party Applications. We also do not screen, audit, or endorse Third Party Websites or Third Party Applications. Accordingly, if you decide to access Third Party Websites or Third Party Applications, you do so at your own risk and agree that your use of any Third Party Websites or Third Party Applications is on an “as-is” basis without any warranty as to the Third Party Websites or Third Party Applications actions, and that this Agreement does not apply to your use of any Third Party Websites or Third Party Applications.<br><br>Wisher Pro offers users access to the integrated Augmented Reality (“AR”) Lens from Snap Inc., providing the opportunity to unleash the full potential of AR for the content they choose to create through their own device's camera, inspiring creativity and self-expression. Users will receive a notification with an option to grant explicit consent along with the outlined terms of usage and privacy before accessing this feature. Users must promptly review Snap Inc.’s Privacy Policy (here), Terms of Service (here) and Learn More section (here) before providing explicit consent to accessing AR features on Wisher Pro. Users can decline acceptance of Snap Inc.’s terms and block an attempt to activate an AR Lens by tapping on the X button on the provided notification. In the event of such a decline, any subsequent efforts to activate a Lens will prompt the user to review and accept the terms once again. For more details about this, please see our Privacy Policy (here). It is necessary to accept and familiarize yourself with these terms in order to ensure a smooth and compliant experience with the Snap Inc.’s AR features on Wisher Pro."
    },
    {
        "title": "9. Modifying Wisher Pro, termination and the appeal",
        "text": "You acknowledge that we may release updated versions of Wisher Pro at any time we deem appropriate, adding new features or enhancements or removing features. You consent to automatic upgrades on your mobile device and agree that the terms and conditions of the Agreement will apply to all such upgrades. You agree that we will not be liable to you for any such modifications.<br><br>If we believe in good faith that you have violated any of the terms and conditions of the Agreement or any applicable law, we may terminate any account you have with Wisher Pro or your use of Wisher Pro or any component thereof and remove and discard all or any part of your account or any of your User Submissions, at any time and at our discretion. You agree that any termination of your access to Wisher Pro or any account you may have on Wisher Pro, or component thereof may be effected without prior notice, and you agree that we will not be liable to you or any third party for any such termination.<br><br>If you believe that revoking your license, any authorization to access and/or use Wisher Pro and terminating your account for failure to comply with our rules on minimum required user age per terms of this Agreement is unjustifiable, please contact us by email at info@wisher.pro or use available in App mechanism to directly appeal the decision. You will have to verify your age and compliance with terms of our Agreement by providing us with a Photographic image of you and your form of identification that can confirm the date of your birth. More information on this process can be found within our comprehensive Privacy Policy.<br><br>You may terminate your account by canceling your subscription as described in section 8 above and deleting your account on the Settings screen in the app under the section My Account/ID."
    },
    {
        "title": "10. Disclaimers",
        "text": "WE (AND ANY THIRD PARTY PROVIDER OF SOFTWARE, SERVICES, OR APPLICATIONS MADE AVAILABLE IN CONJUNCTION WITH OR THROUGH WISHER PRO) PROVIDE WISHER PRO ON AN “AS IS” AND “AS AVAILABLE” BASIS.<br><br>TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, WE GRANT NO WARRANTIES OF ANY KIND, WHETHER EXPRESS, IMPLIED, STATUTORY, OR OTHERWISE WITH RESPECT TO THE SERVICES, INCLUDING BUT NOT LIMITED TO ANY IMPLIED WARRANTIES OF SATISFACTORY QUALITY, MERCHANTABILITY, FITNESS FOR A PARTICULAR PURPOSE, OR NON-INFRINGEMENT OF ANY PROPRIETARY RIGHTS.<br><br>TO THE EXTENT PERMITTED BY APPLICABLE LAW, WE AND OUR SUPPLIERS AND PARTNERS DO NOT WARRANT OR REPRESENT THAT:<br><br>• WISHER PRO WILL BE UNINTERRUPTED OR ERROR-FREE, THAT ANY ERRORS OR DEFECTS WILL BE CORRECTED, OR THAT WISHER PRO OR THE SERVER THAT MAKES IT AVAILABLE AND ACCESSIBLE ARE FREE OF VIRUSES OR OTHER HARMFUL COMPONENTS; OR<br>• THE USE OR THE RESULTS OF THE USE OF ANY LOCATION INFORMATION THROUGH THE WISHER PRO SOFTWARE ARE SAFE, SECURE, CORRECT, ACCURATE, OR RELIABLE. YOU ASSUME THE ENTIRE COST OF ANY SERVICES OR EQUIPMENT NECESSARY TO ACCESS WISHER PRO. YOU UNDERSTAND AND AGREE THAT YOU DOWNLOAD OR OTHERWISE OBTAIN MATERIAL OR DATA THROUGH THE USE OF WISHER PRO AT YOUR OWN DISCRETION AND RISK.<br><br>CONTENT GENERATED BY THE AI DRIVEN CHATBOT DOES NOT REPRESENT WISHER PRO'S STANDPOINT AND IS NOT BINDING UPON WISHER PRO. THIS CONTENT IS ALGORITHM-GENERATED AND MAY NOT BE ACCURATE. RELIANCE ON SUCH CONTENT MAY HAVE LEGAL OR MATERIAL CONSEQUENCES AND USERS SHOULD EXERCISE CAUTION WHEN EVALUATING IT."
    },
    {
        "title": "11. Limitation of liability",
        "text": "TO THE FULLEST EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL WE (OR OUR AFFILIATES, SUBSIDIARIES, CONTRACTORS, EMPLOYEES, AGENTS, SUPPLIERS, OR THIRD PARTY SERVICE PROVIDERS) BE LIABLE FOR ANY INDIRECT, CONSEQUENTIAL, INCIDENTAL, SPECIAL, PUNITIVE, OR EXEMPLARY DAMAGES RELATED TO OR RESULTING FROM (I) THE USE, DISCLOSURE, DISPLAY, OR MAINTENANCE OF YOUR LOCATION INFORMATION, (II) YOUR USE OR INABILITY TO USE WISHER PRO, (III) WISHER PRO GENERALLY (INCLUDING THE WISHER PRO SOFTWARE) OR SYSTEMS THAT MAKE WISHER PRO AVAILABLE, OR (IV) ANY OTHER INTERACTIONS WITH WISHER PRO OR ANY OTHER USER OF WISHER PRO, EVEN IF WE OR AN AUTHORIZED REPRESENTATIVE HAVE BEEN ADVISED OF THE POSSIBILITY OF SUCH DAMAGES.<br><br>TO THE EXTENT PERMITTED BY APPLICABLE LAW, IN NO EVENT SHALL YOUR TOTAL LIABILITY TOWARD US (OR OUR AFFILIATES, SUBSIDIARIES, CONTRACTORS, EMPLOYEES, AGENTS, SUPPLIERS, OR THIRD-PARTY SERVICE PROVIDERS) FOR ALL DAMAGES, LOSSES, AND CAUSES OF ACTION ARISING OUT OF OR RELATING TO THIS AGREEMENT OR YOUR USE OF WISHER PRO (WHETHER IN CONTRACT, TORT, WARRANTY, OR OTHERWISE), EXCEED THE AMOUNTS PAID BY YOU FOR ACCESSING WISHER PRO DURING THE TWELVE (12) MONTHS IMMEDIATELY PRECEDING THE DATE OF YOUR CLAIM.<br><br>THE FOREGOING DOES NOT AFFECT ANY LIABILITY THAT CANNOT BE EXCLUDED OR LIMITED UNDER APPLICABLE LAW.<br><br>Waiver of Section 1542. If you reside in California, with respect to the releases of liability set out in this agreement, you acknowledge that you understand the consequences of entering into the<br><br>general release and discharge of all known and unknown claims as stated in this agreement and that you are familiar with the provisions of section 1542 of the California Civil Code, which provides that:<br><br>A general release does not extend to claims that the creditor or releasing party does not know or suspect to exist in his or her favor at the time of executing the release and that, if known by him or her, would have materially affected his or her settlement with the debtor or released party.<br><br>You hereby waive all rights under section 1542 and under any other federal or state statutes or laws of similar effect."
    },
    {
        "title": "12. Indemnification",
        "text": "To the extent permitted by applicable law, you agree to indemnify, defend, and hold us (and our affiliates, subsidiaries, contractors, employees, agents, or third-party service providers) harmless from any and all claims, suits, actions, losses, costs, damages, and any other liabilities, including legal fees, brought by a third party arising out of or related to (i) your use or misuse of any location information or Wisher Pro generally, (ii) any violation of the rights of any other person or entity by you, (iii) any breach or violation by you of the Agreement, or (iv) your use of Wisher Pro to meet another User in-person or to locate and attend any offline place or event.<br><br>We reserve the right, at your expense, to assume the exclusive defense and control of any matter for which you are required to indemnify us, and you agree to cooperate with our defense of these claims."
    },
    {
        "title": "13. Severability",
        "text": "If any provision of the Agreement shall be partially or fully invalid or for any reason unenforceable, the validity of the other provisions of the Agreement shall not be affected thereby. The invalid or unenforceable provision shall be replaced by a provision that economically best achieves the objectives of the parties."
    },
    {
        "title": "14. Waiver",
        "text": "A provision of the Agreement may be waived only by a written instrument executed by the party entitled to the benefit of such provision. The failure of any party at any time to require performance of any provision of this Agreement shall in no manner affect such party’s right later to enforce the same. A waiver of any breach of any provision of the Agreement shall not be construed as a continuing waiver of other breaches of the same or other provisions of the Agreement."
    },
    {
        "title": "15. Notices",
        "text": "We may provide you with notices, including those regarding changes to the Agreement, by email, or postings on Wisher Pro."
    },
    {
        "title": "16. Assignment",
        "text": "Without our prior written consent, you are not allowed to assign or transfer all or any part of your rights and obligations under the Agreement. We are permitted to assign or transfer our rights and obligations under the Agreement in their entirety or in part."
    },
    {
        "title": "17. Survival",
        "text": "All provisions of this Agreement that require continued performance, compliance, or effect beyond the termination date of the Agreement, including, without limitation, those related to or regarding disclaimer, limitation of liability, and indemnification hereby survive any termination of the Agreement or any termination of your use of or subscription to Wisher Pro and shall be enforceable in the event of a failure to perform or comply.<br><br>ANY CAUSE OF ACTION OR CLAIM YOU MAY HAVE ARISING OUT OF OR RELATING TO THESE TERMS AND CONDITIONS OR THE WEBSITE MUST BE COMMENCED WITHIN ONE (1) YEAR AFTER THE CAUSE OF ACTION ACCRUES; OTHERWISE, SUCH CAUSE OF ACTION OR CLAIM IS PERMANENTLY BARRED."
    },
    {
        "title": "18. Entire Agreement",
        "text": "This Agreement constitutes the entire agreement between the parties relating to the subject matter herein and shall not be modified except in writing, signed by both parties, or by a change to the Agreement made by us as set forth in subsequent versions of the Agreement."
    },
    {
        "title": "19. Governing law",
        "text": "The Agreement shall be governed by and construed in accordance with substantive Swiss law, without giving effect to any laws of conflicts. The predominant purpose of this Agreement is providing services and licensing access to intellectual property and not a “sale of goods.” This Agreement will not be governed by the United Nations Convention on Contracts for the International Sale of Goods, the application of which is expressly excluded."
    },
    {
        "title": "20. Jurisdiction",
        "text": "To the extent permitted by applicable law, all disputes arising in connection with the Agreement shall be subject to the exclusive jurisdiction of the ordinary courts at our legal seat."
    },
    {
        "title": "21. Reporting Claims of Copyright Infringement",
        "text": "We take claims of copyright infringement seriously. We will respond to notices of alleged copyright infringement that comply with applicable law. If you believe any materials accessible on or from the Website infringe your copyright, you may request removal of those materials (or access to them) from the Website by submitting written notification to our copyright agent designated below. In accordance with the Online Copyright Infringement Liability Limitation Act of the Digital Millennium Copyright Act (17 U.S.C. § 512) (“DMCA”), the written notice (the “DMCA Notice”) must include substantially the following:<br><br>Your physical or electronic signature.<br>Identification of the copyrighted work you believe to have been infringed or, if the claim involves multiple works on the Website, a representative list of such works.<br>Identification of the material you believe to be infringing in a sufficiently precise manner to allow us to locate that material.<br>Adequate information by which we can contact you (including your name, postal address, telephone number, and, if available, email address).<br>A statement that you have a good faith belief that use of the copyrighted material is not authorized by the copyright owner, its agent, or the law.<br>A statement that the information in the written notice is accurate.<br>A statement, under penalty of perjury, that you are authorized to act on behalf of the copyright owner. "
    },
    {
        "title": "22. Privacy Policy",
        "text": "Our Privacy Policy provides an in-depth explanation of your interactions with the Wisher Pro. Our Privacy Policy serves as a comprehensive guide to understanding how we collect, utilize, and safeguard your information. We highly recommend that you review and familiarize yourself with the Privacy Policy to gain a complete understanding of our data collection, utilization and security measures."
    },
    {
        "title": "23. Contact",
        "text": "If you have any concerns or require any information regarding the Wisher Pro or Wisher Pro’s Terms and Conditions, please contact us by email at info@wisher.pro"
    }
]
