[
    {
        "title": "Wisher Pro's terms and conditions",
        "text": "These terms and conditions (“Terms and Conditions”) are made between Wisher Pro TOO, Satpayeva st., b. 85, 050046, Almaty, Kazakhstan (“we”, “us”, “our”), and users who (i) use our website https://wisher.pro/ in its entirety, including all of our subpages, associated sites or pages (“Website”) and/or the Wisher Pro mobile app, which is accessible through mobile phone, tablet computer and personal computer (“App”) (collectively, “Wisher Pro”), (ii) download software for Wisher Pro (“Wisher Pro Software”), and/or (iii) use, access, or purchase in App products and services provided by Wisher Pro (“you”, “User”)."
    },
    {
        "title": "1. Acceptance of Terms and Conditions",
        "text": "Please read the following Terms and Conditions carefully before using Wisher Pro.<br><br>By downloading the Wisher Pro Software or using, accessing, or purchasing products and services of Wisher Pro, you are acknowledging that you have read, understood, and agreed to be bound by the (i) Terms and Conditions, (ii) privacy policy (see here), (iii) cookie policy (see here), and (iv) any terms disclosed and agreed to by you if you purchase additional features, products, or services we offer on Wisher Pro (collectively, “Agreement”).<br><br>You acknowledge and agree that the availability of Wisher Pro and the Wisher Pro Software is dependent on the third party from which you received the Wisher Pro Software (e.g., Google Play, Apple App Store, or HUAWEI AppGallery (each, “App Store”)). You acknowledge that the Agreement is between you and us and not with the App Store. Each App Store may have its own terms and conditions to which you must agree before using or accessing Wisher Pro or downloading the Wisher Pro Software.<br><br>If you do not accept and agree to be bound by all the terms of the Agreement and the applicable terms and conditions of the respective App Store, please do not access or use Wisher Pro."
    },
    {
        "title": "2. Modification of the Agreement",
        "text": "We reserve the right to modify, add to, change, or remove parts of the Agreement at any time at our own discretion (“Modifications”).<br><br>If the Modifications include material changes to your rights or obligations, you will be notified at least 10 days in advance of the changes via (i) an email sent to the last email address you provided and (ii) a notice of such alterations posted on Wisher Pro. If, for any reason, an email sent by us to this email address does not reach you, the email sent will nonetheless be considered an effective notice of the changes being undertaken by Wisher Pro.<br><br>If the Modifications are not material, we will notify you by posting a notice of such alterations on Wisher Pro.<br><br>It is your responsibility to provide us with an up-to-date email address and to check from time to time for changes to the Agreement. Please be assured that we will provide clear notifications for any adjustments made to the Agreement. By continuing to use Wisher Pro following the dispatch of an email to you containing notice of changes to the Agreement, or after notice of such alterations was posted on Wisher Pro, your binding acceptance of these alterations is constituted, and agreement that such alterations shall automatically come into effect 10 days after our email giving notice to you was sent, or 10 days after notice of the changes was posted on Wisher Pro, is given."
    },
    {
        "title": "3. Eligibility",
        "text": "To use Wisher Pro, you must have a mobile device that is compatible with the Wisher Pro application. We do not warrant that Wisher Pro will be compatible with your mobile device.<br><br>Section 230(d) Notice. In accordance with 47 U.S.C. § 230(d), you are notified that parental control protections (including computer hardware, software, or filtering services) are commercially available that may help in limiting access to material that is harmful to minors. You may find information about providers of these protections on the Internet by searching “parental control protection” or similar terms. "
    },
    {
        "title": "4. Rights we grant you",
        "text": "We, our subsidiaries, and affiliated companies, own all rights, titles, and interests in any inventions, ideas, discoveries, trade names, logos, domain names, concepts, processes, design methods, trade secrets, know-how, databases, computer programs, work products, and other intellectual property, including related intellectual property rights (including but not limited to patents, copyrights, trademarks, designs, any registration thereof and pending applications therefor), irrespective of their form and whether registerable or legally protectable relating to Wisher Pro and the Wisher Pro Software (collectively, “Materials”).<br><br>Subject to the terms of the Agreement, we hereby grant you a worldwide, non-exclusive, royalty-bearing, revocable, non-transferable, non-sublicensable license to access and use the Materials for your personal, non-commercial use only (“License”). Subject to our express prior written consent, you may not access and use the Materials in any way other than as set out in the Agreement. In particular, and to the extent permitted by applicable law, you may not:<br><br>• modify, disassemble, decompile, or reverse engineer the Materials;<br>• rent, lease, loan, resell, sublicense, distribute, or otherwise transfer the Materials to any third party<br>• publicly perform or display, transmit, or publish the Materials;<br>• make copies, edit, adapt, create derivative works from, or otherwise make unauthorized use of the Materials;<br>• remove, circumvent, disable, damage, or otherwise interfere with security-related features of Wisher Pro;<br>• delete the copyright and other proprietary rights notices on Wisher Pro.<br><br>With respect to any open source or third-party code that may be incorporated in the Materials, such open-source code is covered by the applicable open source or third-party end user license, if any, authorizing use of such code. Nothing in the Agreement limits your rights under, or grants you rights that supersede, the terms and conditions of any applicable end user license for such open-source software.<br>Wisher Pro's name, Wisher Pro's logo, and all related names, logos, product and service names, designs, and slogans are trademarks of Wisher Pro or its affiliates or licensors. You must not use such marks without the prior written permission of Wisher Pro. All other names, logos, product and service names, designs, and slogans on the Website or contained in the Materials are the trademarks of their respective owners."
    },
    {
        "title": "5. Your account credentials, your interactions with other Users",
        "text": "If you choose to use, purchase in App products and services provided by Wisher Pro, or register for an account with Wisher Pro, you confirm and warrant that (i) all the registration information you submit is truthful and accurate and (ii) you will keep this information accurate and up to date.<br><br>If you identify inaccuracies or incompleteness, we will act accordingly, rectify such errors and communicate the necessary updates to the relevant data recipients. Detailed information on this process can be found within our comprehensive Privacy Policy.<br><br>You are responsible for maintaining the confidentiality of your login credentials and for the security of your mobile or other electronic device and are fully responsible for all activities that occur under those credentials. You agree to notify us immediately of any unauthorized or suspected unauthorized use of your Wisher Pro account, or any other breach of security. You shall keep your login credentials (e.g. usernames and passwords) confidential and not disclose any such credentials to, or share any such credentials with, any third party.<br><br>You are solely responsible for your interactions between your profile and the profiles of other Users. You acknowledge that we do not conduct criminal background checks on our Users or otherwise inquire into the background of our Users.<br><br>To the extent permitted by applicable law, you agree that Wisher Pro is not liable for any loss or damage resulting from (i) your failure to comply with the above requirements and/or (ii) your interactions with other User profiles. Please note that we reserve the right (but have no obligation):<br><br>• to monitor any User’s use of Wisher Pro, including registration attempts, and a User’s use of or access to the location information or profiles of other Users;<br>• to monitor disagreements between you and other Users that result in reporting violations of Wisher Pro’s Terms and Conditions;<br>• to monitor the User submissions (defined in Art. 7 of the Terms and Conditions) and communication for any purpose. However, we do not control the User Submissions or communication and you acknowledge that you are solely responsible for all the content or material posted in your User Submissions or included within your conversations, whether sent or received by you;<br>• to disable any User’s access to Wisher Pro, or to close any User’s account, for any reason and without any notice;<br>• to refuse access to any User for any reason, without notice."
    }
]
